lesha108/STM32/SWRProbe/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "dwt_stm32_delay.h"
#include "LiquidCrystal_I2C.h"
#include "fm25w256.h"
#include "tle6208.h"
#include "key8574.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint32_t freqCnt;
uint8_t FramData = 0;
uint16_t tleCommand = 0;

#define SAMPLE_RATE 10
#define NUM_CHANNELS 5
#define ADCCONVERTEDVALUES_BUFFER_SIZE ((uint32_t)  (SAMPLE_RATE * NUM_CHANNELS * 2))     /* Size of array containing ADC converted values */

__IO uint16_t	aADCxConvertedValues[ADCCONVERTEDVALUES_BUFFER_SIZE]; /* ADC conversion results table of regular group, channel on rank1 */
uint16_t        uhADCxConvertedValue_Regular_Avg_half1[NUM_CHANNELS];  /* Average of the 1st half of ADC conversion results table of regular group, channel on rank1 */
uint16_t        uhADCxConvertedValue_Regular_Avg_half2[NUM_CHANNELS];  /* Average of the 2nd half of ADC conversion results table of regular group, channel on rank1 */
uint16_t*       puhADCxConvertedValue_Regular_Avg;       /* Pointer to the average of the 1st or 2nd half of ADC conversion results table of regular group, channel on rank1*/
uint8_t			ADC_new = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

// обработчик для частотомера
void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance==TIM3) //check if the interrupt comes from TIM3
        {

    	if (__HAL_TIM_GET_COMPARE(&htim3, TIM_CHANNEL_1) == 2000) { // запустили
    		__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 10000); // выключим при 10000
    	} else { // остановили
   	    	freqCnt = ((uint32_t)__HAL_TIM_GET_COUNTER(&htim2)) |
   	    			  ((uint32_t)__HAL_TIM_GET_COUNTER(&htim4) << 16);
   	    	__HAL_TIM_SET_COUNTER(&htim2, 0);
   	    	__HAL_TIM_SET_COUNTER(&htim4, 0);
    		__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 2000); // включим при 2000
    		}
    	}
}

// обработчики для АЦП через DMA с усреднением 10 сэмплов
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *AdcHandle)
{
  uint32_t avg_index;
  uint32_t ch_index;
  uint32_t tmp_average;

  /* When the 1st half of the buffer is reached, compute these results while  */
  /* the 2nd half of the buffer is updated by the ADC and DMA transfers.      */

  /* Process average of the 1st half of the buffer */
  for (ch_index = 0; ch_index < NUM_CHANNELS; ch_index++)
  {
	tmp_average = 0;
	for (avg_index = 0; avg_index < SAMPLE_RATE; avg_index++)
	{
		tmp_average += aADCxConvertedValues[SAMPLE_RATE*NUM_CHANNELS + ch_index + avg_index*NUM_CHANNELS];
	}
	uhADCxConvertedValue_Regular_Avg_half2[ch_index] = (uint16_t)(tmp_average/SAMPLE_RATE);
  }
  puhADCxConvertedValue_Regular_Avg = (uint16_t*)&uhADCxConvertedValue_Regular_Avg_half2;
  ADC_new = 1;
}

/**
  * @brief  Conversion DMA half-transfer callback in non blocking mode
  * @param  hadc: ADC handle
  * @retval None
  */
void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{
  uint32_t avg_index;
  uint32_t ch_index;
  uint32_t tmp_average;

  /* When the 1st half of the buffer is reached, compute these results while  */
  /* the 2nd half of the buffer is updated by the ADC and DMA transfers.      */

  /* Process average of the 1st half of the buffer */
  for (ch_index = 0; ch_index < NUM_CHANNELS; ch_index++)
  {
	tmp_average = 0;
	for (avg_index = 0; avg_index < SAMPLE_RATE; avg_index++)
	{
		tmp_average += aADCxConvertedValues[ch_index + avg_index*NUM_CHANNELS];
	}
	uhADCxConvertedValue_Regular_Avg_half1[ch_index] = (uint16_t)(tmp_average/SAMPLE_RATE);
  }
  puhADCxConvertedValue_Regular_Avg = (uint16_t*)&uhADCxConvertedValue_Regular_Avg_half1;
  ADC_new = 1;
}


/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
//ttt
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();
  MX_I2C1_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_ADC1_Init();
  MX_SPI2_Init();
  MX_SPI1_Init();

  /* USER CODE BEGIN 2 */

  // запускаем частотомер
  HAL_TIM_Base_Start(&htim4);    //Start TIM4 without interrupt
  HAL_TIM_Base_Start(&htim2);    //Start TIM2 without interrupt
  HAL_TIM_OC_Start_IT(&htim3, TIM_CHANNEL_1);

  // запускаем вольтметры
  HAL_ADC_Start(&hadc1);
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)aADCxConvertedValues, ADCCONVERTEDVALUES_BUFFER_SIZE);

  // запускаем счетчик микросекунд
  if(DWT_Delay_Init())
  {
    Error_Handler(); /* Call Error Handler */
  }

  // запускаем LCD по I2C
  LCDI2C_init(0x27,16,2);

  int i;
  for( i = 0; i< 3; i++)
  {
    LCDI2C_backlight();
    HAL_Delay(250);
    LCDI2C_noBacklight();
    HAL_Delay(250);
  }
  LCDI2C_backlight(); // finish with backlight on
  LCDI2C_clear();
  LCDI2C_write_String("Hello");

//  FramWriteByte(0x0000, 0xAA); // Проверяем работоспособность FRAM памяти
  //FramData = FramReadByte(0x0000);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

   /* 1s Delay */
    DWT_Delay_us(1000000);

	tleCommand = (1 << 2) | (1 << 3); // LS-Switch 2 + HS-Switch 1
	freqCnt = tleWrite(tleCommand); // пробуем зажечь светодиод

	  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_11);
//	  HAL_Delay(100);
    DWT_Delay_us(100000);
	  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_11);
	    DWT_Delay_us(100000);
//	  HAL_Delay(100);
	  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_11);
	    DWT_Delay_us(100000);
//	  HAL_Delay(100);
	  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_11);
	    DWT_Delay_us(2000000);
//	  HAL_Delay(2000);


		static char freq_Out[20];

		freqCnt = puhADCxConvertedValue_Regular_Avg[0]; // проверека АЦП
		freqCnt = FramReadByte(0x0000); // проверка чипа памяти

		tleCommand = (1 << 1) | (1 << 4); // LS-Switch 1 + HS-Switch 2 = 0x12
		freqCnt = tleWrite(tleCommand); // пробуем зажечь светодиод

		freqCnt = keyRead8574();
		if (freqCnt & PCF8574_KEY1) {
			freqCnt = 1;
		};
		if (freqCnt & PCF8574_KEY2) {
			freqCnt = 2;
		};
		if (freqCnt & PCF8574_KEY3) {
			freqCnt = 3;
		};
		if (freqCnt & PCF8574_KEY4) {
			freqCnt = 4;
		};

		sprintf(freq_Out, "%lu", freqCnt);
        LCDI2C_clear();
		LCDI2C_write_String("Cnt: ");
		LCDI2C_write_String(freq_Out);

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV2;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
